cosmoi.org
#+Title: Cosmoi
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.

#+Options: toc:nil date:t num:nil
#+Options: html-style:nil
#+Options: html-postamble:t
#+Options: tex:dvisvgm

** Writing a bachelor's thesis in org-mode                                                   :post:
:PROPERTIES:
:TITLE: Writing a bachelor's thesis in org-mode
:EXPORT_FILE_NAME: bachelorsthesisinorgmode.html
:INDEX_DATE: <2018-08-15 Wed 23:37>
:END:

My [[https://github.com/mroman42/ctlc/][bachelor's thesis]] has been completely written in org-mode
format. At first, I supposed that org-mode would not be powerful
enough for a really long document with templates and lots of latex
customizations, but I stand corrected. You can insert arbitrary latex
code when needed and there is nothing preventing you to create a complex
header for your org-mode document.

After the experience, I would recommend using org-mode. You can manage
your tasks, your references and your text in a single file; and the
org-mode format is much more pleasant to read and write than the usual
tex format. The only problem I had was compilation: Emacs is really
slow and freezes while compiling. My solution was to use a second
Emacs instance which compiles on the background while I continue to
use the first one; the relevant line on the makefile looks as follows
(thanks to [[https://github.com/ncordon][@ncordon]] for the idea!).

#+BEGIN_SRC bash
emacs thesis.org --batch -u `id -un` \
--eval '(load user-init-file)' \
-f org-latex-export-to-pdf
#+END_SRC

