bachelorsthesisinorgmode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-23 Sun 15:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing a bachelor's thesis in org-mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Writing a bachelor's thesis in org-mode</h1>
<p>
My <a href="https://github.com/mroman42/ctlc/">bachelor's thesis</a> has been completely written in org-mode
format. At first, I supposed that org-mode would not be powerful
enough for a really long document with templates and lots of latex
customizations, but I stand corrected. You can insert arbitrary latex
code when needed and there is nothing preventing you to create a complex
header for your org-mode document.
</p>

<p>
After the experience, I would recommend using org-mode. You can manage
your tasks, your references and your text in a single file; and the
org-mode format is much more pleasant to read and write than the usual
tex format. The only problem I had was compilation: Emacs is really
slow and freezes while compiling. My solution was to use a second
Emacs instance which compiles on the background while I continue to
use the first one; the relevant line on the makefile looks as follows
(thanks to <a href="https://github.com/ncordon">@ncordon</a> for the idea!).
</p>

<div class="org-src-container">
<pre class="src src-bash">emacs thesis.org --batch -u <span style="color: #CC9393;">`id -un`</span> --eval <span style="color: #95e454;">'(load user-init-file)'</span> -f org-latex-export-to-pdf
</pre>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2018-08-15 Wed 23:37. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
